BufferRoot/Modulus-Firmware/firmware/tab5/sdkconfig.defaults
# Modulus Tab5 — ESP-IDF 6.0 defaults (Zig host image scaffold)
CONFIG_IDF_TARGET="esp32p4"
# NOTE: CONFIG_COMPILER_WARNINGS_AS_ERRORS was removed in ESP-IDF 6 and used to
# sit here doing nothing — the build printed
#   NOTE: unknown kconfig symbol 'COMPILER_WARNINGS_AS_ERRORS' assigned to 'y'
# and carried on, so this project has had no warnings-as-errors for as long as
# it has been on IDF 6. IDF 6 has no global equivalent; the closest is leaving
# COMPILER_DISABLE_DEFAULT_ERRORS at its default (n), which keeps IDF's own
# default set of warnings promoted to errors. Stated explicitly so it cannot
# drift silently again.
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=n
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# Tab5 retail P4 is rev 1.x (not 3.x) — match C++ Modulus Firmware sdkconfig
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_0=y
# CONFIG_ESP32P4_REV_MIN_301 is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
# Zig boot + esp_hosted SDIO init (hosted_sdio_card_fn_init inlined 3x + pb-c descriptors) needs >38 KB
CONFIG_ESP_MAIN_TASK_STACK_SIZE=49152
CONFIG_FREERTOS_HZ=1000
# Tab5 32 MB octal PSRAM — required for MIPI-DSI DPI frame buffer (~1.8 MB @ 1280×720)
CONFIG_ESP_LDO_RESERVE_PSRAM=y
CONFIG_ESP_LDO_CHAN_PSRAM_DOMAIN=2
CONFIG_ESP_LDO_VOLTAGE_PSRAM_1800_MV=y
CONFIG_ESP_LDO_VOLTAGE_PSRAM_DOMAIN=1800
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_SPIRAM_USE_MALLOC=y
# F3: skip full PSRAM memtest after bring-up (faster boot)
# CONFIG_SPIRAM_MEMTEST is not set
# Allocs <= threshold prefer internal SRAM (DMA/ISR/SDIO hot path).
# Post LVGL-UI strip: keep threshold low so medium Zig/C temps land in PSRAM
# and leave internal for SDIO desc + FreeRTOS stacks.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
# Reserve 40 KiB internal so malloc never drains ISR/DMA/WiFi hosted path.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=40960
# P4 esp_wifi_remote + LwIP: prefer PSRAM for large WiFi buffers (C6 hosted).
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# Match C++ Modulus Firmware / m5stack_tab5 BSP
# NOTE: CONFIG_BSP_LCD_COLOR_FORMAT_RGB565 used to sit here and does not exist —
# the m5stack_tab5 BSP has no colour-format Kconfig at all; the DPI panel is
# hardcoded to LCD_COLOR_FMT_RGB565 in bsp_display.c. Harmless but it read as
# though it were configuring something. Removed, same as the dead
# COMPILER_WARNINGS_AS_ERRORS above.
#
# CONFIG_LV_COLOR_DEPTH* is left in place deliberately: LVGL is no longer
# linked under CONFIG_MODULUS_ZIG_UI_ENGINE (BSP_CONFIG_NO_GRAPHIC_LIB=1), but
# these are still valid symbols for the non-ZIG_UI build, which the #else
# branches in display_shim/touch_shim keep alive.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
# 4.5 MiB factory — Zig UI omits LVGL widget/fonts/icons ROM (was 5 MiB).
# Headroom watch: scripts/build_tab5.ps1 warns at 85% of factory.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# Wireless crashes reboot the P4 with no trace: without a coredump the backtrace
# is lost unless a monitor happens to be attached. Retrieve with
#   idf.py -p COM5 coredump-info
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64
# LVGL draw/layer buffers from the PSRAM-backed C-library heap, not the tiny
# 64 KB internal builtin TLSF pool. The 64 KB pool exhausts/fragments under the
# 1280x720 sw_rotate render load (layer draw buffers), stalling lv_tlsf_malloc
# and pinning taskLVGL on Core 0 -> IDLE0 WDT.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
# LVGL core refr timer — keep >=30 ms (16 ms caused Core 0 WDT under sw_rotate load)
CONFIG_LV_DEF_REFR_PERIOD=33
# Zig UI path: BSP still links LVGL for panel bind — keep one default font only.
# Full Montserrat tiers live in the LVGL-UI lab build (CONFIG_MODULUS_ZIG_UI_ENGINE=n).
CONFIG_LV_FONT_MONTSERRAT_14=y
# CONFIG_LV_FONT_MONTSERRAT_12 is not set
# CONFIG_LV_FONT_MONTSERRAT_16 is not set
# CONFIG_LV_FONT_MONTSERRAT_18 is not set
# CONFIG_LV_FONT_MONTSERRAT_22 is not set
# CONFIG_LV_FONT_MONTSERRAT_24 is not set
# CONFIG_LV_FONT_MONTSERRAT_28 is not set
# CONFIG_LV_FONT_MONTSERRAT_36 is not set
# CONFIG_LV_FONT_MONTSERRAT_44 is not set
# CONFIG_LV_FONT_MONTSERRAT_48 is not set
# CONFIG_LV_USE_SYSMON is not set
# CONFIG_LV_USE_PERF_MONITOR is not set

# M5Tab5-UserDemo / C++ Modulus BSP: internal I2C0 (G31/32), Port A I2C1 (G53/54)
CONFIG_BSP_I2C_NUM=0

# Modulus hosted wireless — Tab5 P4 host → C6 slave (SDIO2, not EV-board defaults)
CONFIG_MODULUS_WIFI_ENABLED=y
# Cold boot: C6 needs margin after esp_hosted GPIO15 reset (not just WLAN_PWR anchor)
CONFIG_MODULUS_C6_BOOT_DELAY_MS=7000

# ESP-Hosted 2.11.4 — Tab5 SDIO2 pins CLK12 CMD13 D0=11 D1=10 D2=9 D3=8 RST=15
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H2 is not set
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
# CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW is not set
CONFIG_ESP_HOSTED_SDIO_RESET_DELAY_MS=5500
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
# ESP-NOW scan bursts (DISCOVER events) need deeper host RX queues than default 20.
# This exact configuration is field-proven with the pinned esp-hosted 2.11.4.
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=48
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=32
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=12
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=8
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
# CONFIG_ESP_HOSTED_RESET_GPIO_ACTIVE_LOW is not set
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y
CONFIG_ESP_HOSTED_RPC_TASK_STACK=4096
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=3072
CONFIG_ESP_HOSTED_USE_MEMPOOL=y
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_SYNC_RPC_REQUESTS=5
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_ASYNC_RPC_REQUESTS=5
CONFIG_ESP_HOSTED_HOST_TO_ESP_WIFI_DATA_THROTTLE=y
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_HIGH_THRESHOLD=80
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_LOW_THRESHOLD=60
CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=n
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# ESP-NOW CNC: unassociated STA must not sleep between ops (drops unicast MAC ACK → reason=0x01).
# C6 slave also sets CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n in tab5-c6 sdkconfig.
CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE=n

# P4 NimBLE host over esp_hosted VHCI (C6 BLE HCI controller)
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n

# esp-dsp on ESP32-P4 — optimized backend (not ANSI) per esp-dsp issue #113
CONFIG_DSP_OPTIMIZATIONS_SUPPORTED=y
CONFIG_DSP_OPTIMIZED=y
CONFIG_DSP_OPTIMIZATION=1
CONFIG_DSP_MAX_FFT_SIZE=4096

# NOTE: CONFIG_LVGL_PORT_ENABLE_PPA was here and is now a dead symbol —
# esp_lvgl_port is not built at all under CONFIG_MODULUS_ZIG_UI_ENGINE
# (BSP_CONFIG_NO_GRAPHIC_LIB=1 in firmware/tab5/CMakeLists.txt), so its Kconfig
# is never sourced. PPA rotation is ours now: ppa_shim.c owns its own PPA SRM
# client and fb.zig calls it through fb.hw_rotate. Nothing to enable here.

# Dual DPI framebuffers — Zig flips with draw_bitmap(FB addr) for tear-free present.
# (+1.8 MB PSRAM; avoids composing into the live scanout).
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# Zig UI engine owns MIPI scanout (LVGL widget UI not compiled).
CONFIG_MODULUS_ZIG_UI_ENGINE=y
